DataProcessors/TG_ОбработкаПриглашений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>TG_ОбработкаПриглашений</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПриглашенныеСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDПриглашения</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаПриглашения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/TG_Приглашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>TG_Приглашения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IDПриглашения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СсылкаПриглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TG_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/TG_ОбработкаПриглашений/Forms/НовоеПриглашение/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура АдресБотаПриИзмененииНаСервере()
	ЭтотОбъект.СсылкаНаБота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Бот, "СсылкаНаБота");
КонецПроцедуры

&НаКлиенте
Процедура АдресБотаПриИзменении(Элемент)
	АдресБотаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСсылку(Команда)
	
	ЕстьСтароеПриглашение = ПриглашениеСуществует(ЭтотОбъект.Сотрудник);
	Если ЕстьСтароеПриглашение Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для указанного сотрудника уже имеется активное приглашение");
		Возврат;
	КонецЕсли; 
	
	IDПриглашения = Новый УникальныйИдентификатор;	
	СсылкаПриглашения = СтрШаблон("%1?start=%2", ЭтотОбъект.СсылкаНаБота, IDПриглашения); 
	Попытка
		СохранитьПриглашение(ЭтотОбъект.Сотрудник, ЭтотОбъект.Бот, IDПриглашения, СсылкаПриглашения);
	Исключение
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(,НСтр("ru = 'Сохранение нового приглашения не было выполнено по причине:'") 
		+ Символы.ПС + ТекстСообщения);
		Возврат;
	КонецПопытки;
	ЭтотОбъект.СсылкаПриглашения = СсылкаПриглашения; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьПриглашение(Сотрудник, Бот, IDПриглашения, СсылкаПриглашения)
	НаборЗаписей = РегистрыСведений.TG_Приглашения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Значение = Сотрудник;
	НаборЗаписей.Отбор.Бот.Значение = Бот;
	НаборЗаписей.Отбор.Сотрудник.Использование = Истина;
	НаборЗаписей.Отбор.Бот.Использование = Истина;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.IDПриглашения = IDПриглашения;
	НоваяЗапись.Сотрудник = Сотрудник;
	НоваяЗапись.Бот = Бот;
	НоваяЗапись.СсылкаПриглашения = СсылкаПриглашения;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение нового приглашения'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));    
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриглашениеСуществует(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TG_Приглашения.IDПриглашения КАК IDПриглашения
	|ИЗ
	|	РегистрСведений.TG_Приглашения КАК TG_Приглашения
	|ГДЕ
	|	TG_Приглашения.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
 
#КонецОбласти
